configuration/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <basedOn>Catalog.Проекты</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <comment>Дата создания</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовностиКМаштабированию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПодготовки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереходаВТестирование</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлановоеНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлановоеОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзмененияПодчиненных</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <comment>Заказчик проекта</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортированаИзRedmine</name>
    <comment>Признак того, что этот проект является импортированной задачей Redmine</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КороткоеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиRedmine</name>
    <comment>Номер импортированной задачи Redmine</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <comment>Ссылка на другой объект БД, которому подчинен текущий объект</comment>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <comment>Процент выполнения с шагом 10</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФинансовыеЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Catalogs/СтатусыОбъектов/СтатусыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыОбъектов</name>
  <comment>Хранит  элементы, соответствующие определенным статусам объектов.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CodeReview</name>
      <description>Code review</description>
    </items>
    <items>
      <name>DesignReview</name>
      <description>Design review</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ВРеализацию</name>
      <description>В реализацию</description>
    </items>
    <items>
      <name>Внедрение</name>
      <description>Внедрение</description>
    </items>
    <items>
      <name>ВнутреннееТестирование</name>
      <description>Внутреннее тестирование</description>
    </items>
    <items>
      <name>Документирование</name>
      <description>Документирование</description>
    </items>
    <items>
      <name>ЗапросТребований</name>
      <description>Запрос требований</description>
    </items>
    <items>
      <name>Масштабирование</name>
      <description>Масштабирование</description>
    </items>
    <items>
      <name>НаДоработку</name>
      <description>На доработку</description>
    </items>
    <items>
      <name>Рассмотрение</name>
      <description>На рассмотрении</description>
    </items>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонен</description>
    </items>
    <items>
      <name>Отложен</name>
      <description>Отложен</description>
    </items>
    <items>
      <name>Приостановлен</name>
      <description>Приостановлен</description>
    </items>
    <items>
      <name>Проработка</name>
      <description>Проработка</description>
    </items>
    <items>
      <name>Протестирован</name>
      <description>Протестирован</description>
    </items>
    <items>
      <name>Публикация</name>
      <description>Публикация</description>
    </items>
    <items>
      <name>Рассмотрен</name>
      <description>Рассмотрен</description>
    </items>
    <items>
      <name>РевьюТребований</name>
      <description>Ревью требований</description>
    </items>
    <items>
      <name>Решен</name>
      <description>Решен</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяКартинкиВБиблиотеке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЗафиксирован</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс изображения в общей картинке СтатусыОбъектов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядковый номер статуса</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныИзмененияСтатуса</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныИзмененияСтатусов</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/Проекты/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список подключаемых команды панели навигации
// 
// Возвращаемое значение:
//   Список значенией - список подключаемых команды панели навигации
//
Функция КомандыПанелиНавигации() Экспорт

	Команды = Новый СписокЗначений;   
	Команды.Добавить("История", "История", , БиблиотекаКартинок.ПанельНавигацииИстория);
	Команды.Добавить("Участники", "Участники", , БиблиотекаКартинок.Участники);	
	Команды.Добавить("Комментарии", "Комментарии", , БиблиотекаКартинок.Комментарии);
	Команды.Добавить("ЗаинтересованныеЛица", "Заинтересованные лица", , БиблиотекаКартинок.ЗаинтересованныеЛица);
	Команды.Добавить("МатрицаТребований", "Матрица требований", , БиблиотекаКартинок.МатрицаТребований);
	Команды.Добавить("Файлы", "Файлы", , БиблиотекаКартинок.Файлы);
	Команды.Добавить("Связи", "Связи", , БиблиотекаКартинок.Связи);
	Команды.Добавить("ПланПроекта", "План проекта", , БиблиотекаКартинок.ПланПроекта);
	Команды.Добавить("СтруктураПодчиненности", "Структура подчиненности", , БиблиотекаКартинок.СтруктураПодчиненности);
	ИнтеграцияДополнительныхПодсистем.ДобавитьКомандуРасчетПриоритета(Команды);
	
	Возврат Команды;
	
КонецФункции

Функция ПолучитьПрефикс() Экспорт
	
	Возврат "П";
	
КонецФункции

// Возвращает максимально допустимый уровень вложенности проектов
// 
// Возвращаемое значение:
//   - Число
//
Функция МаксимальныйУровеньВложенности() Экспорт
	
	Возврат 4;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИСТОРИЯ ИЗМЕНЕНИЙ ОБЪЕКТА, ОПОВЕЩЕНИЕ ПОЛЬЗОВАТЕЛЕЙ

// Возвращает структуру проверяемых данных
// 
// Возвращаемое значение:
//   - Структура
//		* Реквизиты	 - Массив	 - названия реквизитов которые требуют проверки
//		* ТабличныеЧасти	 - Структура	 - табличные части и их реквизиты которые требуют проверки.
//			Ключ - название табличной части
//			Значение - реквизит табличной части который требуется проверить
//
Функция ПроверяемыеСвойстваОбъекта() Экспорт
	
	Результат = Новый Структура("Реквизиты, ТабличныеЧасти", Новый Массив, Новый Структура);
	
	// Названия реквизитов объекта
	Результат.Реквизиты.Добавить("ДатаЗавершения");
	Результат.Реквизиты.Добавить("ДатаНачалаРазработки");
	Результат.Реквизиты.Добавить("ДатаНачалаРассмотрения");
	Результат.Реквизиты.Добавить("Куратор");
	Результат.Реквизиты.Добавить("ОбъектОснование");
	Результат.Реквизиты.Добавить("Описание");
	Результат.Реквизиты.Добавить("Порядок");
	Результат.Реквизиты.Добавить("Руководитель");
	Результат.Реквизиты.Добавить("Заказчик");
	Результат.Реквизиты.Добавить("ВидПроекта");
	Результат.Реквизиты.Добавить("Статус");
	Результат.Реквизиты.Добавить("Направление");
	Результат.Реквизиты.Добавить("ЮридическоеЛицо");
	Результат.Реквизиты.Добавить("Продукт");
	
	Возврат Результат;
	
КонецФункции

Функция АвтосохраняемыеРеквизиты() Экспорт
	
	СохраняемыеДанные = Новый Структура;
	
	СохраняемыеДанные.Вставить("РеквизитыОбъекта", Новый Массив);
	СохраняемыеДанные.Вставить("ТабличныеЧасти", Новый Структура);
	СохраняемыеДанные.Вставить("РеквизитыФормы", Новый Массив);
	
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("КороткоеНазвание");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("Наименование");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("ВидПроекта");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("Порядок");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("ОбъектОснование");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("Руководитель");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("ВидПроцесса");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("Заказчик");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("ФинансовыеЗатраты");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("ДатаПлановоеНачало");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("ДатаПлановоеОкончание");
	
	Возврат СохраняемыеДанные;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Для ссылочных полей на проект, ограничиваем по статусам.
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Справочники.СтатусыОбъектов.Новый);
	МассивСтатусов.Добавить(Справочники.СтатусыОбъектов.Приостановлен);
	МассивСтатусов.Добавить(Справочники.СтатусыОбъектов.Отклонен);
	МассивСтатусов.Добавить(Справочники.СтатусыОбъектов.Решен);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыОбъектов.Ссылка КАК Статус
	|ИЗ
	|	Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|ГДЕ
	|	НЕ СтатусыОбъектов.ПометкаУдаления
	|	И НЕ СтатусыОбъектов.Ссылка В (&ОграниченияСтатусов)";	
	
	Запрос.УстановитьПараметр("ОграниченияСтатусов", МассивСтатусов);
		
	МассивСтатусов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Статус");
	Параметры.Отбор.Вставить("Статус", МассивСтатусов);
		
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Код");
	Поля.Добавить("Наименование");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("Проект %1. %2", Данные.Код, Данные.Наименование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает ограничения использования полей в динамических списках
// справочника "Проекты".
//
// Параметры:
//  Список - ДинамическийСписок - динамический список.
Процедура УстановитьОграниченияСписка(Список) Экспорт
	
	// Поля, исключаемые из отбора
	ИсключаемыеПоля = Новый Массив;
	ИсключаемыеПоля.Добавить("Предопределенный");
	ИсключаемыеПоля.Добавить("Порядок");
	ИсключаемыеПоля.Добавить("ПометкаУдаления");
	ИсключаемыеПоля.Добавить("ИндексКартинки");
	ИсключаемыеПоля.Добавить("ИмяПредопределенныхДанных");
	ИсключаемыеПоля.Добавить("ДатаПоследнегоИзмененияПодчиненных");	
	Список.УстановитьОграниченияИспользованияВОтборе(ИсключаемыеПоля);
	
	// Поля, исключаемые из сортировки и группировки
	ИсключаемыеПоля = Новый Массив;
	ИсключаемыеПоля.Добавить("ИндексКартинки");
	ИсключаемыеПоля.Добавить("ПометкаУдаления");
	ИсключаемыеПоля.Добавить("Ссылка");
	ИсключаемыеПоля.Добавить("ДатаПоследнегоИзмененияПодчиненных");
	
	Список.УстановитьОграниченияИспользованияВПорядке(ИсключаемыеПоля);
	Список.УстановитьОграниченияИспользованияВГруппировке(ИсключаемыеПоля);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
